#include "khnormal.hpp"
#include <assert.h>
#include <string>
#include <vector>
#include <iostream>

static const std::vector<std::vector<std::string>> FIXTURES = {
  {"ស៊ី","ស៊ី"},
  {"សីុ","ស៊ី"},
  {"សុី","ស៊ី"},
  {"ស៉ី","ស៉ី"},
  {"ម៉ី","ម៉ី"},
  {"មីុ","ម៉ី"},
  {"មុី","ម៉ី"},
  {"ម៊ី","ម៊ី"},
  {"កណ្ដាល","កណ្តាល"},
  {"កណ្តាល","កណ្តាល"},
  {"បន្ត","បន្ត"},
  {"បន្ដ","បន្ត"},
  {"ខ្មែរ","ខ្មែរ"},
  {"ខែ្មរ","ខ្មែរ"},
  {"ស្ត្រី","ស្ត្រី"},
  {"ស្រ្តី","ស្ត្រី"},
  {"ស្ដ្រី","ស្ត្រី"},
  {"ស្រ្ដី","ស្ត្រី"},
  {"ស្ដី្រ","ស្ត្រី"},
  {"ស្តី្រ","ស្ត្រី"},
  {"ស្រី្ដ","ស្ត្រី"},
  {"ស្រី្ត","ស្ត្រី"},
  {"កុំ","កុំ"},
  {"កំុ","កុំ"},
  {"ចាំ","ចាំ"},
  {"ចំា","ចាំ"},
  {"លោក","លោក"},
  {"លេាក","លោក"},
  {"លាេក","លោក"},
  {"ធ្វើ","ធ្វើ"},
  {"ធើ្វ","ធ្វើ"},
  {"ធ្វេី","ធ្វើ"},
  {"ធ្វីេ","ធ្វើ"},
  {"ម្យ៉ាង","ម្យ៉ាង"},
  {"ម៉្យាង","ម្យ៉ាង"},
  {"ស្រ៊ី","ស្រ៊ី"},
  {"ស៊្រី","ស្រ៊ី"},
  {"ស្រុី","ស្រ៊ី"},
  {"ស្រីុ","ស្រ៊ី"},
  {"សុី្រ","ស្រ៊ី"},
  {"សីុ្រ","ស្រ៊ី"},
  {"ស្រ៉ី","ស្រ៉ី"},
  {"ស៊ើប","ស៊ើប"},
  {"ស៊េីប","ស៊ើប"},
  {"ស៊ីេប","ស៊ើប"},
  {"សុើប","ស៊ើប"},
  {"សើុប","ស៊ើប"},
  {"សុេីប","ស៊ើប"},
  {"សុីេប","ស៊ើប"},
  {"សីុេប","ស៊ើប"},
  {"សីេុប","ស៊ើប"},
  {"សេុីប","ស៊ើប"},
  {"សេីុប","ស៊ើប"},
  {"ស៉េីប","ស៉ើប"},
  {"ស៉ីេប","ស៉ើប"},
  {"ស៊ាំ","ស៊ាំ"},
  {"សំុា","ស៊ាំ"},
  {"សុំា","ស៊ាំ"},
  {"សំុំា","ស៊ាំំ"},
  {"សាុំ","ស៊ាំ"},
  {"សុាំ","ស៊ាំ"},
  {"ស៉ាំ","ស៉ាំ"},
  {"សាំុ","ស៊ាំ"},
  {"សាំុ","ស៊ាំ"},
  {"ឡ","ឡ"},
  {"ទ្ប","ទ្ប"},
  {"ឫ","ឫ"},
  {"ប្ញ","ប្ញ"},
  {"ឬ","ឬ"},
  {"ប្ញុ","ប្ញុ"},
  {"ញ","ញ"},
  {"ឭា","ឭា"},
  {"ឮា","ឮា"},
  {"ព្ញា","ព្ញា"},
  {"ឭ","ឭ"},
  {"ព្ញ","ព្ញ"},
  {"ឮ","ឮ"},
  {"ព្ញុ","ព្ញុ"},
  {"ឭុ","ឭុ"},
  {"ឰ","ឰ"},
  {"ព្ឋ","ព្ឋ"},
  {"ឱ","ឱ"},
  {"ឧិ","ឧិ"},
  {"ឧ៌","ឧ៌"},
  {"ឧ៍","ឧ៍"},
};

int main() {
  for (auto &p: FIXTURES) {
    std::string left = p[0];
    std::string right = p[1];
    left = khnormal(left);
    
    if (0 != left.compare(right)) {
      std::cout << left  << " => " << right << std::endl;
    }

    assert(0 == left.compare(right));
  }
}